Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1064dag176.h
extern volatile __C2FIFOCI3bits_t C2FIFOCI3bits __asm__ ("C2FIFOCI3") __attribute__((section("sfrs"), address(0xBF881440)));
extern volatile uint32_t        C2FIFOCI3CLR __attribute__((section("sfrs"),address(0xBF881444)));
extern volatile uint32_t        C2FIFOCI3SET __attribute__((section("sfrs"),address(0xBF881448)));
extern volatile uint32_t        C2FIFOCI3INV __attribute__((section("sfrs"),address(0xBF88144C)));
#define C2FIFOCON4 C2FIFOCON4
extern volatile uint32_t   C2FIFOCON4 __attribute__((section("sfrs"), address(0xBF881450)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON4bits_t;
extern volatile __C2FIFOCON4bits_t C2FIFOCON4bits __asm__ ("C2FIFOCON4") __attribute__((section("sfrs"), address(0xBF881450)));
extern volatile uint32_t        C2FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF881454)));
extern volatile uint32_t        C2FIFOCON4SET __attribute__((section("sfrs"),address(0xBF881458)));
extern volatile uint32_t        C2FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88145C)));
#define C2FIFOINT4 C2FIFOINT4
extern volatile uint32_t   C2FIFOINT4 __attribute__((section("sfrs"), address(0xBF881460)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT4bits_t;
extern volatile __C2FIFOINT4bits_t C2FIFOINT4bits __asm__ ("C2FIFOINT4") __attribute__((section("sfrs"), address(0xBF881460)));
extern volatile uint32_t        C2FIFOINT4CLR __attribute__((section("sfrs"),address(0xBF881464)));
extern volatile uint32_t        C2FIFOINT4SET __attribute__((section("sfrs"),address(0xBF881468)));
extern volatile uint32_t        C2FIFOINT4INV __attribute__((section("sfrs"),address(0xBF88146C)));
#define C2FIFOUA4 C2FIFOUA4
extern volatile uint32_t   C2FIFOUA4 __attribute__((section("sfrs"), address(0xBF881470)));
extern volatile uint32_t        C2FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF881474)));
extern volatile uint32_t        C2FIFOUA4SET __attribute__((section("sfrs"),address(0xBF881478)));
extern volatile uint32_t        C2FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88147C)));
#define C2FIFOCI4 C2FIFOCI4
extern volatile uint32_t   C2FIFOCI4 __attribute__((section("sfrs"), address(0xBF881480)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI4bits_t;
extern volatile __C2FIFOCI4bits_t C2FIFOCI4bits __asm__ ("C2FIFOCI4") __attribute__((section("sfrs"), address(0xBF881480)));
extern volatile uint32_t        C2FIFOCI4CLR __attribute__((section("sfrs"),address(0xBF881484)));
extern volatile uint32_t        C2FIFOCI4SET __attribute__((section("sfrs"),address(0xBF881488)));
extern volatile uint32_t        C2FIFOCI4INV __attribute__((section("sfrs"),address(0xBF88148C)));
#define C2FIFOCON5 C2FIFOCON5
extern volatile uint32_t   C2FIFOCON5 __attribute__((section("sfrs"), address(0xBF881490)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON5bits_t;
extern volatile __C2FIFOCON5bits_t C2FIFOCON5bits __asm__ ("C2FIFOCON5") __attribute__((section("sfrs"), address(0xBF881490)));
extern volatile uint32_t        C2FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF881494)));
extern volatile uint32_t        C2FIFOCON5SET __attribute__((section("sfrs"),address(0xBF881498)));
extern volatile uint32_t        C2FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88149C)));
#define C2FIFOINT5 C2FIFOINT5
extern volatile uint32_t   C2FIFOINT5 __attribute__((section("sfrs"), address(0xBF8814A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT5bits_t;
extern volatile __C2FIFOINT5bits_t C2FIFOINT5bits __asm__ ("C2FIFOINT5") __attribute__((section("sfrs"), address(0xBF8814A0)));
extern volatile uint32_t        C2FIFOINT5CLR __attribute__((section("sfrs"),address(0xBF8814A4)));
extern volatile uint32_t        C2FIFOINT5SET __attribute__((section("sfrs"),address(0xBF8814A8)));
extern volatile uint32_t        C2FIFOINT5INV __attribute__((section("sfrs"),address(0xBF8814AC)));
#define C2FIFOUA5 C2FIFOUA5
extern volatile uint32_t   C2FIFOUA5 __attribute__((section("sfrs"), address(0xBF8814B0)));
extern volatile uint32_t        C2FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF8814B4)));
extern volatile uint32_t        C2FIFOUA5SET __attribute__((section("sfrs"),address(0xBF8814B8)));
extern volatile uint32_t        C2FIFOUA5INV __attribute__((section("sfrs"),address(0xBF8814BC)));
#define C2FIFOCI5 C2FIFOCI5
extern volatile uint32_t   C2FIFOCI5 __attribute__((section("sfrs"), address(0xBF8814C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI5bits_t;
