Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1064dag176.h
extern volatile __DDRSCLLATbits_t DDRSCLLATbits __asm__ ("DDRSCLLAT") __attribute__((section("sfrs"), address(0xBF8E910C)));
#define DDRSCLCFG0 DDRSCLCFG0
extern volatile uint32_t   DDRSCLCFG0 __attribute__((section("sfrs"), address(0xBF8E9118)));
typedef struct {
  uint32_t BURST8:1;
  uint32_t DDR2:1;
  uint32_t :2;
  uint32_t RCASLAT:4;
  uint32_t :16;
  uint32_t ODTCSW:1;
} __DDRSCLCFG0bits_t;
extern volatile __DDRSCLCFG0bits_t DDRSCLCFG0bits __asm__ ("DDRSCLCFG0") __attribute__((section("sfrs"), address(0xBF8E9118)));
#define DDRSCLCFG1 DDRSCLCFG1
extern volatile uint32_t   DDRSCLCFG1 __attribute__((section("sfrs"), address(0xBF8E911C)));
typedef struct {
  uint32_t SCLCSEN:1;
  uint32_t :7;
  uint32_t WCASLAT:4;
  uint32_t DBLREFDLY:1;
} __DDRSCLCFG1bits_t;
extern volatile __DDRSCLCFG1bits_t DDRSCLCFG1bits __asm__ ("DDRSCLCFG1") __attribute__((section("sfrs"), address(0xBF8E911C)));
#define DDRPHYPADCON DDRPHYPADCON
extern volatile uint32_t   DDRPHYPADCON __attribute__((section("sfrs"), address(0xBF8E9120)));
typedef struct {
  uint32_t ODTSEL:1;
  uint32_t ODTEN:1;
  uint32_t DATDRVSEL:1;
  uint32_t ADDCDRVSEL:1;
  uint32_t ODTPDCAL:2;
  uint32_t ODTPUCAL:2;
  uint32_t EOENCLKCYC:1;
  uint32_t NOEXTDLL:1;
  uint32_t :3;
  uint32_t WRCMDDLY:1;
  uint32_t HALFRATE:1;
  uint32_t :1;
  uint32_t DRVSTRNFET:4;
  uint32_t DRVSTRPFET:4;
  uint32_t :4;
  uint32_t RCVREN:1;
  uint32_t PREAMBDLY:2;
} __DDRPHYPADCONbits_t;
extern volatile __DDRPHYPADCONbits_t DDRPHYPADCONbits __asm__ ("DDRPHYPADCON") __attribute__((section("sfrs"), address(0xBF8E9120)));
#define DDRPHYDLLR DDRPHYDLLR
extern volatile uint32_t   DDRPHYDLLR __attribute__((section("sfrs"), address(0xBF8E9124)));
typedef struct {
  uint32_t :8;
  uint32_t RECALIBCNT:18;
  uint32_t DISRECALIB:1;
  uint32_t :1;
  uint32_t DLYSTVAL:4;
} __DDRPHYDLLRbits_t;
extern volatile __DDRPHYDLLRbits_t DDRPHYDLLRbits __asm__ ("DDRPHYDLLR") __attribute__((section("sfrs"), address(0xBF8E9124)));
#define DDRPHYDLLCTRL DDRPHYDLLCTRL
extern volatile uint32_t   DDRPHYDLLCTRL __attribute__((section("sfrs"), address(0xBF8E9128)));
typedef struct {
  uint32_t DDRDLLTRIM:8;
} __DDRPHYDLLCTRLbits_t;
extern volatile __DDRPHYDLLCTRLbits_t DDRPHYDLLCTRLbits __asm__ ("DDRPHYDLLCTRL") __attribute__((section("sfrs"), address(0xBF8E9128)));
#define DDRPHYCLKDLY DDRPHYCLKDLY
extern volatile uint32_t   DDRPHYCLKDLY __attribute__((section("sfrs"), address(0xBF8E9140)));
typedef struct {
  uint32_t CLKDLYDELTA:3;
  uint32_t :1;
  uint32_t SCLLBPASS:1;
  uint32_t SCLUBPASS:1;
} __DDRPHYCLKDLYbits_t;
extern volatile __DDRPHYCLKDLYbits_t DDRPHYCLKDLYbits __asm__ ("DDRPHYCLKDLY") __attribute__((section("sfrs"), address(0xBF8E9140)));
#define DDRADLLBYP DDRADLLBYP
extern volatile uint32_t   DDRADLLBYP __attribute__((section("sfrs"), address(0xBF8E915C)));
typedef struct {
  uint32_t :24;
  uint32_t ANLDLLBYP:1;
} __DDRADLLBYPbits_t;
extern volatile __DDRADLLBYPbits_t DDRADLLBYPbits __asm__ ("DDRADLLBYP") __attribute__((section("sfrs"), address(0xBF8E915C)));
#define DDRSCLCFG2 DDRSCLCFG2
extern volatile uint32_t   DDRSCLCFG2 __attribute__((section("sfrs"), address(0xBF8E916C)));
typedef struct {
  uint32_t SCLLANSEL:2;
} __DDRSCLCFG2bits_t;
extern volatile __DDRSCLCFG2bits_t DDRSCLCFG2bits __asm__ ("DDRSCLCFG2") __attribute__((section("sfrs"), address(0xBF8E916C)));
#define DDRPHYSCLADR DDRPHYSCLADR
extern volatile uint32_t   DDRPHYSCLADR __attribute__((section("sfrs"), address(0xBF8E9188)));
typedef struct {
  uint32_t SCLROWADR:16;
  uint32_t SCLCOLADR:13;
  uint32_t SCLBANKADR:3;
} __DDRPHYSCLADRbits_t;
extern volatile __DDRPHYSCLADRbits_t DDRPHYSCLADRbits __asm__ ("DDRPHYSCLADR") __attribute__((section("sfrs"), address(0xBF8E9188)));
#define GLCDMODE GLCDMODE
extern volatile uint32_t   GLCDMODE __attribute__((section("sfrs"), address(0xBF8EA000)));
typedef struct {
  uint32_t :5;
  uint32_t RGBSEQ:3;
  uint32_t FORMATCLK:1;
  uint32_t YUVOUTPUT:1;
  uint32_t :9;
  uint32_t FORCEBLANK:1;
  uint32_t PGRAMPEN:1;
  uint32_t :1;
  uint32_t PCLKPOL:1;
  uint32_t VSYNCCYC:1;
  uint32_t DITHER:1;
  uint32_t :1;
  uint32_t DEPOL:1;
  uint32_t HSYNCPOL:1;
  uint32_t VSYNCPOL:1;
  uint32_t :1;
  uint32_t CURSOREN:1;
  uint32_t LCDEN:1;
} __GLCDMODEbits_t;
extern volatile __GLCDMODEbits_t GLCDMODEbits __asm__ ("GLCDMODE") __attribute__((section("sfrs"), address(0xBF8EA000)));
#define GLCDCLKCON GLCDCLKCON
extern volatile uint32_t   GLCDCLKCON __attribute__((section("sfrs"), address(0xBF8EA004)));
typedef struct {
  uint32_t CLKDIV:6;
  uint32_t :2;
  uint32_t LPREFETCH:6;
} __GLCDCLKCONbits_t;
extern volatile __GLCDCLKCONbits_t GLCDCLKCONbits __asm__ ("GLCDCLKCON") __attribute__((section("sfrs"), address(0xBF8EA004)));
#define GLCDBGCOLOR GLCDBGCOLOR
extern volatile uint32_t   GLCDBGCOLOR __attribute__((section("sfrs"), address(0xBF8EA008)));
typedef struct {
  uint32_t ALPHA:8;
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDBGCOLORbits_t;
extern volatile __GLCDBGCOLORbits_t GLCDBGCOLORbits __asm__ ("GLCDBGCOLOR") __attribute__((section("sfrs"), address(0xBF8EA008)));
#define GLCDRES GLCDRES
extern volatile uint32_t   GLCDRES __attribute__((section("sfrs"), address(0xBF8EA00C)));
typedef struct {
  uint32_t RESY:11;
  uint32_t :5;
  uint32_t RESX:11;
} __GLCDRESbits_t;
extern volatile __GLCDRESbits_t GLCDRESbits __asm__ ("GLCDRES") __attribute__((section("sfrs"), address(0xBF8EA00C)));
#define GLCDFPORCH GLCDFPORCH
extern volatile uint32_t   GLCDFPORCH __attribute__((section("sfrs"), address(0xBF8EA014)));
typedef struct {
  uint32_t FPORCHY:11;
  uint32_t :5;
  uint32_t FPORCHX:11;
} __GLCDFPORCHbits_t;
extern volatile __GLCDFPORCHbits_t GLCDFPORCHbits __asm__ ("GLCDFPORCH") __attribute__((section("sfrs"), address(0xBF8EA014)));
#define GLCDBLANKING GLCDBLANKING
extern volatile uint32_t   GLCDBLANKING __attribute__((section("sfrs"), address(0xBF8EA018)));
typedef struct {
  uint32_t BLANKINGY:11;
  uint32_t :5;
  uint32_t BLANKINGX:11;
} __GLCDBLANKINGbits_t;
extern volatile __GLCDBLANKINGbits_t GLCDBLANKINGbits __asm__ ("GLCDBLANKING") __attribute__((section("sfrs"), address(0xBF8EA018)));
#define GLCDBPORCH GLCDBPORCH
extern volatile uint32_t   GLCDBPORCH __attribute__((section("sfrs"), address(0xBF8EA01C)));
typedef struct {
  uint32_t BPORCHY:11;
  uint32_t :5;
  uint32_t BPORCHX:11;
} __GLCDBPORCHbits_t;
extern volatile __GLCDBPORCHbits_t GLCDBPORCHbits __asm__ ("GLCDBPORCH") __attribute__((section("sfrs"), address(0xBF8EA01C)));
#define GLCDCURSOR GLCDCURSOR
extern volatile uint32_t   GLCDCURSOR __attribute__((section("sfrs"), address(0xBF8EA020)));
typedef struct {
  uint32_t CURSORY:11;
  uint32_t :5;
  uint32_t CURSORX:11;
} __GLCDCURSORbits_t;
extern volatile __GLCDCURSORbits_t GLCDCURSORbits __asm__ ("GLCDCURSOR") __attribute__((section("sfrs"), address(0xBF8EA020)));
#define GLCDL0MODE GLCDL0MODE
extern volatile uint32_t   GLCDL0MODE __attribute__((section("sfrs"), address(0xBF8EA030)));
typedef struct {
  uint32_t COLORMODE:4;
  uint32_t :4;
  uint32_t SRCBLEND:4;
  uint32_t DESTBLEND:4;
  uint32_t ALPHA:8;
  uint32_t :4;
  uint32_t MULALPHA:1;
  uint32_t FORCEALPHA:1;
  uint32_t DISABIFIL:1;
  uint32_t LAYEREN:1;
} __GLCDL0MODEbits_t;
